app/Controllers/ProdutoController.php

    public function index()
    {
        $produtoModel = new ProdutoModel();
        $dados = array();
        $dados["produtos"] = $produtoModel->findAll();
---
SELECT *
FROM `produto`